app/controllers/home_controller.rb

  def welcome
    @random_user = facebook_session.user.friends[rand(facebook_session.user.friends.length)]
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def home
    #@dtype = rand(2)
    @dtype = 0
    if read_stream?
      @random_user = User.random_fb_friend(facebook_session)
    else
      @random_user = facebook_session.user.friends[rand(facebook_session.user.friends.length)]
    end
    if @dtype == 0
      @new_fb_user = facebook_session.fql_query("SELECT name,pic FROM user WHERE uid=#{@random_user}").first
      @question = random_question(firstName(@new_fb_user.name))
    end
    if current_user.login_count == 1
      @random_user = facebook_session.user.friends[rand(facebook_session.user.friends.length)]
      current_user.increment! :login_count
---
SELECT * FROM `users` WHERE (`users`.`id` = '5') LIMIT 1
UPDATE `users` SET `updated_at` = '2009-12-26 22:55:13', `image_large` = 'http://profile.ak.fbcdn.net/v22940/474/100/n100000598397739_5868.jpg', `facebook_uid` = 100000598397739, `name` = 'Dave Teztera', `created_at` = '2009-12-26 22:55:13', `permalink` = 'Dave-Teztera-x-1', `image_thumb` = 'http://profile.ak.fbcdn.net/v22940/474/100/q100000598397739_5868.jpg', `image_small` = 'http://profile.ak.fbcdn.net/v22940/474/100/s100000598397739_5868.jpg' WHERE `id` = 14