app/controllers/search_controller.rb

  def index
    @results = User.search( params[:search], params[:page])
---
SELECT * FROM `users` WHERE (name like '%people%') ORDER BY name LIMIT 0, 5