app/controllers/statements_controller.rb

SELECT * FROM `statements`
---
  def index
    @statements = Statement.all

INSERT INTO `statements` (`by`, `created_at`, `updated_at`, `user_id`, `content`, `question`, `by_link`, `score`, `friend_id`) VALUES('Akshay Dodeja', '2009-12-28 22:49:23', '2009-12-28 22:49:23', 5, 'Akshay like to play sports occasionally. He loves watching cricket though. ', 'Is Akshay good at sports?', 'Akshay-Dodeja', NULL, 1)
---
  def create
    @statement = Statement.new(params[:statement])
    user = User.find params[:statement][:user_id], :select => "facebook_uid, name"
    message = @statement.content.gsub(/'/, "")
    if @statement.save

SELECT * FROM `statements` WHERE (`statements`.`id` = 1)
DELETE FROM `statements` WHERE `id` = 1
---
  def destroy
    @statement = Statement.find(params[:id])
    @statement.destroy

SELECT * FROM `statements` WHERE (`statements`.`id` = 16)
UPDATE `statements` SET `updated_at` = '2009-12-29 01:02:54', `score` = -1 WHERE `id` = 16
INSERT INTO `votes` (`voteable_id`, `voter_id`, `vote`, `voteable_type`, `created_at`, `updated_at`, `voter_type`) VALUES(16, 5, 1, 'Statement', '2009-12-29 00:40:03', '2009-12-29 00:40:03', 'User')
---
  def vote
    begin
      statement = Statement.find params[:id]
      if params[:type] == "like"
        current_user.vote_for(statement)
        Statement.add_voter(true, current_user, statement)
      else
        current_user.vote_against(statement)
        Statement.add_voter(false, current_user, statement)
      end
      pos_score = statement.votes_for
      neg_score = statement.votes_against
      score = pos_score - neg_score
      statement.update_attribute(:score, score)
      render :update do |page|
        page.replace_html "statement_vote_#{params[:id]}", score
        page.replace_html "#{params[:type]}-#{params[:id]}", "#{params[:type]}"
        page["#{params[:type]}-#{params[:id]}"].addClass('voted');
      end
    rescue ActiveRecord::StatementInvalid
      render :update do |page|
        page << "alert('Already voted!');"