app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`permalink` = 'Akshay-Dodeja') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = '11') LIMIT 1
SELECT `statements`.* FROM `statements` WHERE (`statements`.user_id = 5) ORDER BY created_at DESC
SELECT `whois`.* FROM `whois` WHERE (`whois`.for_user_id = 3)
---
  def show
    @user = User.find_by_permalink params[:title], :include => [:statements, :tags, :badgeings]
    @whois = Whois.find @user.current_whois unless @user.current_whois == 0