app/controllers/user_sessions_controller.rb

INSERT INTO `users` (`name`, `image_thumb`, `permalink`, `last_request_at`, `created_at`, `crypted_password`, `current_whois`, `facebook_uid`, `image_large`, `updated_at`, `failed_login_count`, `current_login_ip`, `image_small`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `facebook_session_key`, `last_login_ip`, `last_login_at`, `email`) VALUES('Akshay Dodeja', 'http://profile.ak.fbcdn.net/v227/64/30/q42002206_8282.jpg', 'Akshay-Dodeja-Portland', NULL, '2009-12-27 00:52:58', NULL, 0, 42002206, 'http://profile.ak.fbcdn.net/v227/64/30/n42002206_8282.jpg', '2009-12-27 00:52:58', 0, NULL, 'http://profile.ak.fbcdn.net/v227/64/30/s42002206_8282.jpg', NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL)
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save