app/controllers/whois_controller.rb

SELECT * FROM `whois`
---
  def index
    @whois = Whois.all

SELECT * FROM `whois` WHERE (`whois`.`friend_id` = '5')
---
  def show
    @whois = Whois.find_all_by_friend_id(params[:id])

SELECT id, name, current_whois FROM `users` WHERE (`users`.`id` = 3)
INSERT INTO `whois` (`by`, `created_at`, `updated_at`, `version`, `user_id`, `content`, `by_link`, `friend_id`) VALUES('Akshay Dodeja', '2009-12-28 23:22:10', '2009-12-28 23:22:10', 1, 5, 'Dave is joker. ', NULL, 1)
---
  def create
    @whois = Whois.new(params[:whois])
    @user = User.find params[:whois][:user_id], :select => "id, name, current_whois"
    if @whois.save

SELECT * FROM `whois` WHERE (`whois`.`id` = 11)
UPDATE `whois` SET `content` = 'Set this version as a new version', `updated_at` = '2009-12-27 02:17:14', `version` = 11 WHERE `id` = 11
---
  def update
    @whois = Whois.find(params[:id])
    if @whois.update_attributes(params[:whois])

UPDATE `users` SET `updated_at` = '2009-12-28 21:52:18', `last_request_at` = '2009-12-28 21:52:18' WHERE `id` = 1
SELECT * FROM `whois` WHERE (`whois`.`id` = 1)
---
  def change_whois
    current_user.update_attribute(:current_whois, params[:id])
    whois = Whois.find params[:id]