app/controllers/whois_controller.rb

  def create
    params[:whois][:user_id] = Whois.new_user(current_user.id, params[:whois][:fb_user], facebook_session) if params[:whois][:user_id].blank?
    @whois = Whois.new(params[:whois])
    if @whois.save
    @user = User.find params[:whois][:user_id], :select => "id, name, current_whois, permalink, facebook_uid"
---
SELECT * FROM `users` WHERE (`users`.`facebook_uid` = 42002206) LIMIT 1